# УЧЕБНЫЕ ПРОЕКТЫ
## Здесь собраны некоторые учебные проекты.
| # | Название проекта | Описание | Инструменты и навыки |
|---|-------|----|-----|
| 1 | [Сегментация клиентов банка](Bank_client_clustering) | Сегментации клиентов банка по продуктам и отточности, и проверен ряд гипотез. | Python, алгоритмы, pandas, исследовательский анализ данных, SQL, PostgreSQL, статистика, проверка статистических гипотез|
|2|[Оценка результатов A/B-теста](A_B_testing)|Приоритезировать гипотезы, произвести оценку результатов A/B-тестирования различными методами| Python, pandas A/B-тест, статистический тест, фреймворк, RICE, ICE|
|3|[Прогнозирование вероятности оттока пользователей для фитнес-центров](Fitness_ML)|На основе данных о посетителях сети фитнес-центров спрогнозировать вероятность оттока для каждого клиента в следующем месяце, сформировать с помощью кластеризации портреты пользователей|KMeans, Machine Learning, дендрограмма, RandomForestClassifier, LogisticRegression|
|4|[Примеры дашбордов в Tableau](https://public.tableau.com/app/profile/k.r1843/vizzes)|Несколько дашбордов на базе открытых данных|Tableau/PowerBI/Datalens|
